In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
import time
import geopandas as gpd

In [2]:
dataset_path = "datasets/"
test_image_output_path = "test_image_outputs/"
master_datasets_path = "master_datasets/"
old_code_path = "old_code/"
code_path = "code/"

In [6]:
ice_df = pd.read_csv('master_datasets/ice_surface_area.csv')
ice_df.head()

   year   mo      data-type   region   extent     area
0  1979    9        Goddard        N     7.05     4.58
1  1980    9        Goddard        N     7.67     4.87
2  1981    9        Goddard        N     7.14     4.44
3  1982    9        Goddard        N     7.30     4.43
4  1983    9        Goddard        N     7.39     4.70

In [7]:
ice_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   year           42 non-null     int64
 1    mo            42 non-null     int64
 2       data-type  42 non-null     object
 3    region        42 non-null     object
 4    extent        42 non-null     float64
 5      area        42 non-null     float64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.1+ KB

In [8]:
ice_df.columns

Index(['year', ' mo', '    data-type', ' region', ' extent', '   area'], dtype='object')

In [9]:
ice_df = ice_df[['year',' extent']]
ice_df.head()

   year   extent
0  1979     7.05
1  1980     7.67
2  1981     7.14
3  1982     7.30
4  1983     7.39

In [10]:
ice_df.rename(columns = {'year':'Year', ' extent':'Arctic_sea_ice_extent'}, 
               inplace = True)
ice_df.head()

   Year  Arctic_sea_ice_extent
0  1979                   7.05
1  1980                   7.67
2  1981                   7.14
3  1982                   7.30
4  1983                   7.39

In [12]:
ice_df.tail()

    Year  Arctic_sea_ice_extent
37  2016                   4.53
38  2017                   4.82
39  2018                   4.79
40  2019                   4.36
41  2020                   3.92

In [11]:
ice_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Year                   42 non-null     int64
 1   Arctic_sea_ice_extent  42 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 800.0 bytes

In [41]:
from datetime import date
from itertools import product

y = np.arange(1979,2021)
d = [15]
m = [1]
cols = ['Year','Month','Day']
year_list = pd.DataFrame(list(product(y, m, d)), columns=cols)

DATE = []
for y, m in zip(year_list.Year, year_list.Month):
    DATE.append(date(y, 1, 15))


year_list['Date'] = DATE
year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    42 non-null     int64
 1   Month   42 non-null     int64
 2   Day     42 non-null     int64
 3   Date    42 non-null     object
dtypes: int64(3), object(1)
memory usage: 1.4+ KB

In [42]:
year_list.head()

   Year  Month  Day        Date
0  1979      1   15  1979-01-15
1  1980      1   15  1980-01-15
2  1981      1   15  1981-01-15
3  1982      1   15  1982-01-15
4  1983      1   15  1983-01-15

In [17]:
year_list = year_list[['Date']]
year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    42 non-null     object
dtypes: object(1)
memory usage: 464.0+ bytes

In [19]:
ice_df2 = pd.concat([ice_df, year_list], axis=1)
ice_df2.head()

   Year  Arctic_sea_ice_extent        Date
0  1979                   7.05  1979-01-15
1  1980                   7.67  1980-01-15
2  1981                   7.14  1981-01-15
3  1982                   7.30  1982-01-15
4  1983                   7.39  1983-01-15

In [20]:
ice_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Year                   42 non-null     int64
 1   Arctic_sea_ice_extent  42 non-null     float64
 2   Date                   42 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 1.1+ KB

In [21]:
ice_df2 = ice_df2[['Date', 'Arctic_sea_ice_extent']]
ice_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   42 non-null     object
 1   Arctic_sea_ice_extent  42 non-null     float64
dtypes: float64(1), object(1)
memory usage: 800.0+ bytes

In [28]:
ice_df2.Date = pd.to_datetime(ice_df2.Date)
ice_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   42 non-null     datetime64[ns]
 1   Arctic_sea_ice_extent  42 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 800.0 bytes

In [57]:
from datetime import date
from itertools import product

y = np.arange(1979,2021)
d = [15]
m = np.arange(1,13)
cols = ['Year','Month','Day']
new_year_list = pd.DataFrame(list(product(y, m, d)), columns=cols)

DATE = []
for y, m in zip(new_year_list.Year, new_year_list.Month):
    DATE.append(date(y, m, 15))


new_year_list['Date'] = DATE
new_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504 entries, 0 to 503
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    504 non-null    int64
 1   Month   504 non-null    int64
 2   Day     504 non-null    int64
 3   Date    504 non-null    object
dtypes: int64(3), object(1)
memory usage: 15.9+ KB

In [58]:
new_year_list.head()

   Year  Month  Day        Date
0  1979      1   15  1979-01-15
1  1979      2   15  1979-02-15
2  1979      3   15  1979-03-15
3  1979      4   15  1979-04-15
4  1979      5   15  1979-05-15

In [59]:
new_year_list = new_year_list[['Date']]
new_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504 entries, 0 to 503
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    504 non-null    object
dtypes: object(1)
memory usage: 4.1+ KB

In [60]:
new_year_list.Date = pd.to_datetime(new_year_list.Date)
new_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504 entries, 0 to 503
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    504 non-null    datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 4.1 KB

In [61]:
new_year_list.head()

        Date
0 1979-01-15
1 1979-02-15
2 1979-03-15
3 1979-04-15
4 1979-05-15

In [31]:
merged = pd.merge(new_year_list, ice_df2, how='left', left_on=['Date'], right_on=['Date'])
merged.head(14)

         Date  Arctic_sea_ice_extent
0  1979-01-15                   7.05
1  1979-02-15                    NaN
2  1979-03-15                    NaN
3  1979-04-15                    NaN
4  1979-05-15                    NaN
5  1979-06-15                    NaN
6  1979-07-15                    NaN
7  1979-08-15                    NaN
8  1979-09-15                    NaN
9  1979-10-15                    NaN
10 1979-11-15                    NaN
11 1979-12-15                    NaN
12 1980-01-15                   7.67
13 1980-02-15                    NaN

In [33]:
merged = merged.fillna(method='ffill')
merged.head(14)

         Date  Arctic_sea_ice_extent
0  1979-01-15                   7.05
1  1979-02-15                   7.05
2  1979-03-15                   7.05
3  1979-04-15                   7.05
4  1979-05-15                   7.05
5  1979-06-15                   7.05
6  1979-07-15                   7.05
7  1979-08-15                   7.05
8  1979-09-15                   7.05
9  1979-10-15                   7.05
10 1979-11-15                   7.05
11 1979-12-15                   7.05
12 1980-01-15                   7.67
13 1980-02-15                   7.67

In [34]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 504 entries, 0 to 503
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   504 non-null    datetime64[ns]
 1   Arctic_sea_ice_extent  504 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 11.8 KB

In [37]:
merged.Date.min()

Timestamp('1979-01-15 00:00:00')

In [38]:
merged.Date.max()

Timestamp('2020-12-15 00:00:00')

In [69]:
from datetime import date
from itertools import product

y = np.arange(1850,1979)
d = [15]
m = np.arange(1,13)
cols = ['Year','Month','Day']
before_year_list = pd.DataFrame(list(product(y, m, d)), columns=cols)

DATE = []
for y, m in zip(before_year_list.Year, before_year_list.Month):
    DATE.append(date(y, m, 15))


before_year_list['Date'] = DATE
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    1548 non-null   int64
 1   Month   1548 non-null   int64
 2   Day     1548 non-null   int64
 3   Date    1548 non-null   object
dtypes: int64(3), object(1)
memory usage: 48.5+ KB

In [70]:
before_year_list.head()

   Year  Month  Day        Date
0  1850      1   15  1850-01-15
1  1850      2   15  1850-02-15
2  1850      3   15  1850-03-15
3  1850      4   15  1850-04-15
4  1850      5   15  1850-05-15

In [71]:
before_year_list = before_year_list[['Date']]
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1548 non-null   object
dtypes: object(1)
memory usage: 12.2+ KB

In [72]:
before_year_list.Date = pd.to_datetime(before_year_list.Date)
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1548 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 12.2 KB

In [73]:
before_year_list.head()

        Date
0 1850-01-15
1 1850-02-15
2 1850-03-15
3 1850-04-15
4 1850-05-15

In [74]:
before_year_list.tail()

           Date
1543 1978-08-15
1544 1978-09-15
1545 1978-10-15
1546 1978-11-15
1547 1978-12-15

In [75]:
before_year_list['Arctic_sea_ice_extent'] = 7.05
before_year_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   1548 non-null   datetime64[ns]
 1   Arctic_sea_ice_extent  1548 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 24.3 KB

In [76]:
before_year_list.head()

        Date  Arctic_sea_ice_extent
0 1850-01-15                   7.05
1 1850-02-15                   7.05
2 1850-03-15                   7.05
3 1850-04-15                   7.05
4 1850-05-15                   7.05

In [77]:
before_year_list.tail()

           Date  Arctic_sea_ice_extent
1543 1978-08-15                   7.05
1544 1978-09-15                   7.05
1545 1978-10-15                   7.05
1546 1978-11-15                   7.05
1547 1978-12-15                   7.05

In [80]:
final = [before_year_list, merged]
final = pd.concat(final)
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2052 entries, 0 to 503
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   2052 non-null   datetime64[ns]
 1   Arctic_sea_ice_extent  2052 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 48.1 KB

In [83]:
final.reset_index(drop=True, inplace=True)

In [84]:
final.head()

        Date  Arctic_sea_ice_extent
0 1850-01-15                   7.05
1 1850-02-15                   7.05
2 1850-03-15                   7.05
3 1850-04-15                   7.05
4 1850-05-15                   7.05

In [85]:
final.tail()

           Date  Arctic_sea_ice_extent
2047 2020-08-15                   3.92
2048 2020-09-15                   3.92
2049 2020-10-15                   3.92
2050 2020-11-15                   3.92
2051 2020-12-15                   3.92

In [86]:
final.iloc[1547]

Date                     1978-12-15 00:00:00
Arctic_sea_ice_extent                   7.05
Name: 1547, dtype: object

In [87]:
final.iloc[1548]

Date                     1979-01-15 00:00:00
Arctic_sea_ice_extent                   7.05
Name: 1548, dtype: object

In [88]:
final.iloc[1549]

Date                     1979-02-15 00:00:00
Arctic_sea_ice_extent                   7.05
Name: 1549, dtype: object

In [89]:
final.iloc[1560]

Date                     1980-01-15 00:00:00
Arctic_sea_ice_extent                   7.67
Name: 1560, dtype: object

In [90]:
final.to_csv(dataset_path + 'FINAL_ICE.csv', encoding='utf-8', index=False)